Revit 2024 API
ParameterTypeId.TilePatternFamrefComponentExtents Property
 "Component Extents"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId TilePatternFamrefComponentExtents { get; }
Visual Basic
Public Shared ReadOnly Property TilePatternFamrefComponentExtents As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ TilePatternFamrefComponentExtents {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace